zeroWin/BP_MSP430/main.c
void SendDCAndACToCC2530(uint16 DC_temp,uint16 AC_temp,uint16 BP_HIGH_temp,uint16 BP_LOW_temp)
{
  HalBPMeasWriteToBuf(DC_temp);
  HalBPMeasWriteToBuf(AC_temp);
  writeNum++;
  if(writeNum == 16)
  {
    HalBPMeasWriteToBuf(BP_HIGH_temp);
    HalBPMeasWriteToBuf(BP_LOW_temp);
    bufferFullFlag = 1;
    writeNum = 0;
  }
}


void SendDCAndACToSDcard(uint16 DC_temp,uint16 AC_temp)
{
  HalBPMeasWriteToBuf(DC_temp);
  HalBPMeasWriteToBuf(AC_temp);
  writeNum++;
  if(writeNum == 128)
  {
    bufferFullFlag = 1;
    writeNum = 0;
  }
}
void SendBP_HighAndLowoCC2530(uint16 BP_HIGH_temp,uint16 BP_LOW_temp)
{
  uint8 i,bufferSend[68];
  for(i = 0; i < 64; ++i)
    bufferSend[i] = 0xFF;
  
  bufferSend[i++] = (BP_HIGH_temp & 0x00FF);
  bufferSend[i++] = ((BP_HIGH_temp & 0xFF00) >> 8);
  bufferSend[i++] = (BP_LOW_temp & 0x00FF);
  bufferSend[i++] = ((BP_LOW_temp & 0xFF00) >> 8); 
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
}

void Show_Wait_Symbol(const char *p)
{
    HalOledShowString(SPO2_Symbol_Start_X,0,12,p);
//    HalOledShowString(SPO2_Symbol_Start_X+88,0,12,"mmHg");
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+16,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+32,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+16,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+32,HR_Wait_Symbol_Start_Y,1);
    
    // 显示电量
    HalShowBattVol(BATTERY_MEASURE_SHOW);
}


/*********************************************************************
 * @fn      GenericApp_GetWriteName
 *
 * @brief   Get the RTC time and make file name.
 *
 * @param   char *
 *          0:D/20xx-xx-xx xx-xx-xx x.txt + \0 = 30Byte
 *
 * @return  
 *
 */
void GenericApp_GetWriteName(void)
{
  RTCStruct_t RTCStruct;
  HalRTCGetOrSetFull(RTC_DS1302_GET,&RTCStruct);

  // Make file name
  fileName[0] = '0';
  fileName[1] = ':';
  fileName[2] = 'B';
  fileName[3] = '/';
  fileName[4] = '2';
  fileName[5] = '0';
  fileName[6] = RTCStruct.year/10 + '0';
  fileName[7] = RTCStruct.year%10 + '0';
  fileName[8] = '-';
  fileName[9] = RTCStruct.month/10 + '0';
  fileName[10] = RTCStruct.month%10 + '0';
  fileName[11] = '-';
  fileName[12] = RTCStruct.date/10 + '0';
  fileName[13] = RTCStruct.date%10 + '0';
  fileName[14] = ' ';
  fileName[15] = RTCStruct.hour/10 + '0';
  fileName[16] = RTCStruct.hour%10 + '0';
  fileName[17] = '-';
  fileName[18] = RTCStruct.min/10 + '0';
  fileName[19] = RTCStruct.min%10 + '0';
  fileName[20] = '-';
  fileName[21] = RTCStruct.sec/10 + '0';
  fileName[22] = RTCStruct.sec%10 + '0';
  fileName[23] = ' ';  
  fileName[24] = RTCStruct.week + '0';
  fileName[25] = '.';
  fileName[26] = 't';
  fileName[27] = 'x';
  fileName[28] = 't';
  fileName[29] = '\0';
}

/*********************************************************************
 * @fn      GenericApp_OpenDir
 *
 * @brief   找到指定目录下文件
 *
 * @param  
 *
 * @return  true is over,flase is not over
 *
 */
bool GenericApp_OpenDir(void)
{
  uint8 res = 0;
  DIR *fddir = 0;         // 目录
  FILINFO *finfo = 0;     // 文件信息
  uint8 *fn = 0;          // 长文件名
  
  // initilize pathname
  strcpy(pathname,"0:S/");
  
  // 申请内存
  fddir = (DIR *)malloc(sizeof(DIR));
  finfo = (FILINFO *)malloc(sizeof(FILINFO));
  if(fddir == NULL || finfo == NULL)
  {
    if(fddir != NULL)
      free(fddir);
    if(finfo != NULL)
      free(finfo);
    return FALSE;
  }
  
  finfo->lfsize = 28 + 1;
  finfo->lfname = malloc(finfo->lfsize);
  if(finfo->lfname == NULL)
  {
    free(finfo->lfname);
    free(fddir);
    free(finfo);
    return FALSE;
  }
  
  // 打开源目录
  res = f_opendir(fddir,"0:S");

  if(res == 0)  // 打开目录成功
  {
    while(res == 0)
    {
      res = f_readdir(fddir,finfo);   //读取目录下的一个文件
     
      if(res != FR_OK || finfo->fname[0] == 0) // 出错或者读到了结尾
      {
        free(finfo->lfname);
        free(fddir);
        free(finfo);
        return FALSE;
      }
      
      if(finfo->fname[0] == '.') // 忽略上层文件
        continue;
      
      /* 存在文件,保存字符串 */
      fn = (uint8 *)(*finfo->lfname?finfo->lfname:finfo->fname);
      strcat((char *)pathname,(char *)fn);
      
      break;
    }
  }
  
  free(finfo->lfname);
  free(fddir);
  free(finfo);
  return TRUE;  
}